father('Рюрик I, кн. Новгородский', 'Игорь I Старый, вел. кн. Киевский').
father('Игорь I Старый, вел. кн. Киевский', 'Святослав I, вел.кн. Киевский').
father('Святослав I, вел.кн. Киевский', 'Ярополк I Святославич, вел.кн. Киевский').
father('Святослав I, вел.кн. Киевский', 'Олег Святославич, кн. Древлянский').
father('Святослав I, вел.кн. Киевский', 'Владимир I Святославич Святой, вел.кн. Киевский').
father('Володислав ', 'Святослав I, вел.кн. Киевский').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Вышеслав Владимирович, кн. Новгородский').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Ярослав I Владимирович Мудрый, вел.кн. Киевский').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Изяслав Владимирович, кн. Полоцкий').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Всеволод Владимирович, кн. Владимиро-Волынский').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Предслава Владимировна, кнж. Киевская').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Премислава Владимировна, кнж. Киевская').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Святополк I Владимирович Окаянный, вел.кн. Киевский').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Святослав Владимирович, кн. Древлянский').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Мстислав Владимирович Храбрый, кн. Тмутараканский').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Станислав Владимирович, кн. Смоленский').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Судислав Владимирович, кн. Псковский').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Борис Владимирович Святой, кн. Ростовский').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Глеб Владимирович Святой, кн. Муромский').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Позвизд Владимирович, кнж. Киевский').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'Мария-Добронега Владимировна, кнж. Киевская').
father('Владимир I Святославич Святой, вел.кн. Киевский', 'N, кнж. Киевская').
father('Ярослав I Владимирович Мудрый, вел.кн. Киевский', 'Илья Ярославич, кн. Новгородский').
father('Ярослав I Владимирович Мудрый, вел.кн. Киевский', 'Святослав II Ярославич, вел.кн. Киевский').
father('Ярослав I Владимирович Мудрый, вел.кн. Киевский', 'Всеволод I Ярославич, вел.кн. Киевский').
father('Ярослав I Владимирович Мудрый, вел.кн. Киевский', 'Владимир Ярославич, кн. Новгородский').
father('Ярослав I Владимирович Мудрый, вел.кн. Киевский', 'Изяслав I (Дмитрий) Ярославич, вел.кн. Киевский').
father('Ярослав I Владимирович Мудрый, вел.кн. Киевский', 'Елизавета Ярославна, кнж. Киевская').
father('Ярослав I Владимирович Мудрый, вел.кн. Киевский', 'Анастасия Ярославна, кнж. Киевская').
father('Ярослав I Владимирович Мудрый, вел.кн. Киевский', 'Вячеслав Ярославич, кн. Смоленский').
father('Ярослав I Владимирович Мудрый, вел.кн. Киевский', 'Игорь Ярославич, кн. Владимиро-Волынский').
father('Ярослав I Владимирович Мудрый, вел.кн. Киевский', 'Анна Ярославна Киевская').
father('Святослав II Ярославич, вел.кн. Киевский', 'Олег Святославич Гориславич, кн. Черниговский').
father('Святослав II Ярославич, вел.кн. Киевский', 'Предслава Святославна, кнж. Киевская').
father('Святослав II Ярославич, вел.кн. Киевский', 'Давыд Святославич, кн. Черниговский').
father('Святослав II Ярославич, вел.кн. Киевский', 'Роман Святославич Красный, кн. Тмутараканский').
father('Святослав II Ярославич, вел.кн. Киевский', 'Глеб Святославич, кн. Новгородский').
father('Святослав II Ярославич, вел.кн. Киевский', 'Ярослав (Панкратий) Святославич, кн. Муромский').
father('Олег Святославич Гориславич, кн. Черниговский', 'Всеволод II Ольгович, вел.кн. Киевский').
father('Олег Святославич Гориславич, кн. Черниговский', 'Игорь II Ольгович, вел.кн. Киевский').
father('Всеволод II Ольгович, вел.кн. Киевский', 'Святослав III Всеволодович, вел.кн. Киевский').
father('Всеволод II Ольгович, вел.кн. Киевский', 'Ярослав Всеволодович, кн. Черниговский').
father('Всеволод II Ольгович, вел.кн. Киевский', 'Владимир Всеволодович, кнж. Черниговский').
father('Всеволод II Ольгович, вел.кн. Киевский', 'Анна Всеволодовна, кнж. Черниговская').
father('Всеволод II Ольгович, вел.кн. Киевский', 'Звенислава Всеволодовна, кнж. Черниговская').
father('Святослав III Всеволодович, вел.кн. Киевский', 'Всеволод III Святославич Чермный, вел.кн. Киевский').
father('Святослав III Всеволодович, вел.кн. Киевский', 'Болеслава Святославна, кнж. Черниговская').
father('Святослав III Всеволодович, вел.кн. Киевский', 'Олег Святославич, кн. Черниговский').
father('Святослав III Всеволодович, вел.кн. Киевский', 'Владимир Святославич, кн. Новгородский').
father('Святослав III Всеволодович, вел.кн. Киевский', 'Глеб Святославич, кн. Черниговский').
father('Святослав III Всеволодович, вел.кн. Киевский', 'Мстислав Святославич, кн. Черниговский').
father('Всеволод III Святославич Чермный, вел.кн. Киевский', 'Михаил II Всеволодович Святой, вел.кн. Киевский').
father('Всеволод III Святославич Чермный, вел.кн. Киевский', 'Андрей Всеволодович, кнж. Черниговский').
father('Всеволод III Святославич Чермный, вел.кн. Киевский', 'Агафья Всеволодовна, кнж. Черниговская').
father('Всеволод III Святославич Чермный, вел.кн. Киевский', 'Вера Всеволодовна, кнж. Черниговская').
father('Михаил II Всеволодович Святой, вел.кн. Киевский', 'Семен Михайлович, кн. Глуховский').
father('Михаил II Всеволодович Святой, вел.кн. Киевский', 'Мстислав Михайлович, кн. Карачевский').
father('Михаил II Всеволодович Святой, вел.кн. Киевский', 'Юрий Михайлович, кн. Тарусский').
father('Михаил II Всеволодович Святой, вел.кн. Киевский', 'Ростислав Михайлович, кн. Черниговский').
father('Михаил II Всеволодович Святой, вел.кн. Киевский', 'Феодулия (Ефросинья) Михайловна Святая, кнж. Черниговская').
father('Михаил II Всеволодович Святой, вел.кн. Киевский', 'Мария Михайловна, кнж. Черниговская').
father('Михаил II Всеволодович Святой, вел.кн. Киевский', 'Роман Михайлович Старый, кн. Брянский').
father('Всеволод I Ярославич, вел.кн. Киевский', 'Владимир II Всеволодович Мономах, вел.кн Киевский').
father('Всеволод I Ярославич, вел.кн. Киевский', 'Анна (Янка) Всеволодовна, кнж. Киевская').
father('Всеволод I Ярославич, вел.кн. Киевский', 'Ростислав Всеволодович, кн. Переяславский').
father('Всеволод I Ярославич, вел.кн. Киевский', 'Евпраксия (Адельгейда) Всеволодовна, кнж. Киевская').
father('Всеволод I Ярославич, вел.кн. Киевский', 'Екатерина Всеволодовна, кнж. Киевская').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Мстислав I Владимирович Великий, вел.кн. Киевский').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Юрий I Владимирович Долгорукий, вел.кн. Киевский').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Агафья Владимировна, кнж. Киевская').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Роман Владимирович, кн. Владимиро-Волынский').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Роман Владимирович, кн. Владимиро-Волынский').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Изяслав Владимирович, кн. Курский').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Святослав Владимирович, кн. Переяславский').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Ярополк II Владимирович, вел.кн. Киевский').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Мария Владимировна, кнж. Киевская').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Евдоксия (Софья) Владимировна, кнж. Киевская').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Евфимия Владимировна, кнж. Киевский').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Вячеслав Владимирович, вел.кн. Киевский').
father('Владимир II Всеволодович Мономах, вел.кн Киевский', 'Андрей Владимирович Добрый, кн. Владимиро-Волынский').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Изяслав II Мстиславич, вел.кн. Киевский').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Ростислав I Мстиславич, вел. кн. Киевский').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Ксения Мстиславна, кнж. Киевская').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Ингеборга Мстиславна, кнж. Киевская').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Святолюба Мстиславна, кнж. Киевская').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Всеволод (Гавриил) Мстиславич, кн. Новгородский').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Агафья Мстиславна, кнж. Киевская').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Малфрида Мстиславна, кнж. Киевская').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Евпраксия (Ирина) Мстиславна, кнж. Киевская').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Святополк Мстиславич, кн. Владимиро-Волынский').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Рогнеда Мстиславна, кнж. Киевская').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Михаил Мстиславич, кнж. Киевский').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Ярополк Мстиславич, кн. Поросский').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Ефросинья Умная Мстиславна, кнж. Киевская').
father('Мстислав I Владимирович Великий, вел.кн. Киевский', 'Владимир III Мстиславич Мачешич, вел.кн. Киевский').
father('Изяслав II Мстиславич, вел.кн. Киевский', 'Мстислав II Изяславич, вел.кн. Киевский').
father('Изяслав II Мстиславич, вел.кн. Киевский', 'Ярополк Изяславич, кн. Бужский').
father('Изяслав II Мстиславич, вел.кн. Киевский', 'Ярослав II Изяславич, кн. Луцкий').
father('Мстислав II Изяславич, вел.кн. Киевский', 'Роман II Мстиславич Великий, кн. Владимиро-Волынский').
father('Мстислав II Изяславич, вел.кн. Киевский', 'Святослав Мстиславич, кн. Владимиро-Волынский').
father('Мстислав II Изяславич, вел.кн. Киевский', 'Владимир Мстиславич, кн. Берестейский').
father('Мстислав II Изяславич, вел.кн. Киевский', 'Всеволод Мстиславич, кн. Бельзский').
father('Ростислав I Мстиславич, вел. кн. Киевский', 'Рюрик II Ростиславич, вел. кн. Киевский').
father('Ростислав I Мстиславич, вел. кн. Киевский', 'Давыд Ростиславич, кн. Смоленский').
father('Ростислав I Мстиславич, вел. кн. Киевский', 'Роман I Ростиславич, вел.кн. Киевский').
father('Ростислав I Мстиславич, вел. кн. Киевский', 'Агафья Ростиславна, кнж. Смоленская').
father('Ростислав I Мстиславич, вел. кн. Киевский', 'Мстислав Ростиславич Храбрый, кн. Новгородский').
father('Ростислав I Мстиславич, вел. кн. Киевский', 'Святослав Ростиславич, кн. Новгородский').
father('Ростислав I Мстиславич, вел. кн. Киевский', 'Юрий Ростиславич, кнж. Смоленский').
father('Ростислав I Мстиславич, вел. кн. Киевский', 'Елена Ростиславна, кнж. Смоленская').
father('Ростислав I Мстиславич, вел. кн. Киевский', 'Аграфена Ростиславна, кнж. Смоленская').
father('Рюрик II Ростиславич, вел. кн. Киевский', 'Владимир IV (Дмитрий) Рюрикович, вел.кн. Киевский').
father('Рюрик II Ростиславич, вел. кн. Киевский', 'Ярослава Рюриковна, кнж. Смоленская').
father('Рюрик II Ростиславич, вел. кн. Киевский', 'Предслава Рюриковна, кнж. Смоленская').
father('Рюрик II Ростиславич, вел. кн. Киевский', 'Анастасия Рюриковна, кнж. Смоленская').
father('Рюрик II Ростиславич, вел. кн. Киевский', 'Ростислав II Рюрикович, вел.кн. Киевский').
father('Рюрик II Ростиславич, вел. кн. Киевский', 'Всеслава Рюриковна, кнж. Смоленская').
father('Владимир IV (Дмитрий) Рюрикович, вел.кн. Киевский', 'Андрей Владимирович Долгая Рука, кн. Вяземский').
father('Владимир IV (Дмитрий) Рюрикович, вел.кн. Киевский', 'Ростислав Владимирович, кнж. Смоленский').
father('Владимир IV (Дмитрий) Рюрикович, вел.кн. Киевский', 'Марина Владимировна, кнж. Смоленская').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Ольга Юрьевна, кнж. Киевская').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Глеб Юрьевич, вел.кн. Киевский').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Андрей I Юрьевич Боголюбский, вел. кн. Владимирский').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Елена Юрьевна, кнж. Суздальская').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Борис Юрьевич, кн. Белгородский').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Ростислав Юрьевич, кн. Новгородский').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Иван Юрьевич, кн. Курский').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Мария Юрьевна, кнж. Суздальская').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Мстислав Юрьевич, кн. Новгородский').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Всеволод III Юрьевич Большое Гнездо, вел. кн. Владимирский').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Михаил (Михалко) II Юрьевич, вел.кн. Владимирский').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Ярослав Юрьевич, кнж. Суздальский').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Святослав Юрьевич, кн. Юрьевский').
father('Юрий I Владимирович Долгорукий, вел.кн. Киевский', 'Василько Юрьевич, кн. Суздальский').
father('Олег Младший, кн. Ладожский', 'Ольга Мудрая, кн. Киевская').
father('Будивид (Лютувер), вел.кн. Литовский', 'Федор, кн. Киевский').
father('Мстислав III Романович Старый, вел.кн. Киевский', 'Агафья Мстиславна, кнж. Смоленская').
father('Мстислав III Романович Старый, вел.кн. Киевский', 'Святослав Мстиславич, кн. Смоленский').
father('Мстислав III Романович Старый, вел.кн. Киевский', 'Всеволод Мстиславич, кн. Смоленский').
father('Мстислав III Романович Старый, вел.кн. Киевский', 'Ростислав Мстиславич, кнж. Смоленский').
father('Мстислав III Романович Старый, вел.кн. Киевский', 'Андрей Мстиславич, кнж. Смоленский').
father('Изяслав I (Дмитрий) Ярославич, вел.кн. Киевский', 'Мстислав Изяславич, кн. Новгородский').
father('Изяслав I (Дмитрий) Ярославич, вел.кн. Киевский', 'Ярополк Изяславич, кн. Владимиро-Волынский').
father('Изяслав I (Дмитрий) Ярославич, вел.кн. Киевский', 'Святополк II (Михаил) Изяславич, вел.кн. Киевский').
father('Изяслав I (Дмитрий) Ярославич, вел.кн. Киевский', 'Евпраксия (Вышеслава) Изяславна, кнж. Киевская').
father('Давыд Святославич, кн. Черниговский', 'Изяслав III Давыдович, вел.кн. Киевский').
father('Владимир Игоревич, кн. Новгород-Северский', 'Изяслав IV Владимирович, вел.кн. Киевский').
father('Святополк II (Михаил) Изяславич, вел.кн. Киевский', 'Мстислав Святополчич, кн. Владимиро-Волынский').
father('Святополк II (Михаил) Изяславич, вел.кн. Киевский', 'Анна Святополковна, кнж. Киевская').
father('Святополк II (Михаил) Изяславич, вел.кн. Киевский', 'Предслава Святополковна, кнж. Киевская').
father('Святополк II (Михаил) Изяславич, вел.кн. Киевский', 'Сбыслава Святополковна, кнж. Киевская').
father('Святополк II (Михаил) Изяславич, вел.кн. Киевский', 'Ярослав Святополчич, кн. Владимиро-Волынский').
father('Святополк II (Михаил) Изяславич, вел.кн. Киевский', 'Изяслав Святополчич, кнж. Киевский').
father('Святополк II (Михаил) Изяславич, вел.кн. Киевский', 'Брячислав Святополчич, кнж. Киевский').
father('Святополк II (Михаил) Изяславич, вел.кн. Киевский', 'Мария Святополковна, кнж. Киевская').
father('Ростислав II Рюрикович, вел.кн. Киевский', 'Измарагда (Смарагда) Ростиславна, кнж. Смоленская').
father('Ростислав II Рюрикович, вел.кн. Киевский', 'Ефросинья Ростиславна, кнж. Смоленская').
father('Глеб Юрьевич, вел.кн. Киевский', 'Ольга Глебовна, кнж. Киевская').
father('Глеб Юрьевич, вел.кн. Киевский', 'Владимир Глебович, кн. Переяславский').
father('Глеб Юрьевич, вел.кн. Киевский', 'Изяслав Глебович, кнж. Киевский').
father('Роман I Ростиславич, вел.кн. Киевский', 'Ярополк Романович, кн. Смоленский').
father('Роман I Ростиславич, вел.кн. Киевский', 'Мстислав III Романович Старый, вел.кн. Киевский').
father('Роман I Ростиславич, вел.кн. Киевский', 'Борис Романович, кн. Псковский').
father('Изяслав IV Владимирович, вел.кн. Киевский', 'Федор Изяславич, кнж. Новгород-Северский').
father('Владимир III Мстиславич Мачешич, вел.кн. Киевский', 'Мстислав Владимирович, кн. Трепольский').
father('Владимир III Мстиславич Мачешич, вел.кн. Киевский', 'Ростислав Владимирович, кн. Дорогобужский').
father('Владимир III Мстиславич Мачешич, вел.кн. Киевский', 'Ярослав Владимирович, кн. Новгородский').
father('Владимир III Мстиславич Мачешич, вел.кн. Киевский', 'Святополк Владимирович, кн. Дорогобужский').
father('Владимир III Мстиславич Мачешич, вел.кн. Киевский', 'Святослав Владимирович, кн. Яневский').
father('Ольгерд (Александр) Гедиминович, вел.кн. Литовский', 'Владимир Ольгердович, кн. Киевский').
father('Александр (Олелько) Владимирович, кн. Киевский', 'Юлиана Александровна, кнж. Киевская').
father('Александр (Олелько) Владимирович, кн. Киевский', 'Евдокия Александровна, кнж. Киевская').
father('Александр (Олелько) Владимирович, кн. Киевский', 'Семен Александрович, кн. Киевский').
father('Александр (Олелько) Владимирович, кн. Киевский', 'Феодосия Александровна, кнж. Киевская').
father('Александр (Олелько) Владимирович, кн. Киевский', 'Михаил Александрович, кн. Слуцкий').
father('Вячеслав Владимирович, вел.кн. Киевский', 'Михаил Вячеславич, кнж. Туровский').
father('Владимир Ольгердович, кн. Киевский', 'Александр (Олелько) Владимирович, кн. Киевский').
father('Владимир Ольгердович, кн. Киевский', 'Анастасия Владимировна, кнж. Киевская').
father('Владимир Ольгердович, кн. Киевский', 'Иван Владимирович, кн. Бельский').
father('Владимир Ольгердович, кн. Киевский', 'Андрей Владимирович, кн. Киевский').
father('Семен Александрович, кн. Киевский', 'Александра Семеновна, кнж. Киевская').
father('Семен Александрович, кн. Киевский', 'Софья Семеновна, кнж. Киевская').
father('Семен Александрович, кн. Киевский', 'Елена Семеновна, кнж. Киевская').
father('Семен Александрович, кн. Киевский', 'Василий Семенович, кн. Пинский').
father('Андрей Владимирович, кн. Киевский', 'Глеб Андреевич, кн. Киевский').
father('Андрей Владимирович, кн. Киевский', 'Евдокия Андреевна, кнж. Киевская').
father('Борис Корьятович, кн. Подольский', 'Иван Борисович, кн. Киевский').
mother('Ефанда 	 ', 'Игорь I Старый, вел. кн. Киевский').
mother('Ольга Мудрая, кн. Киевская', 'Святослав I, вел.кн. Киевский').
mother('Предслава Моравская', 'Ярополк I Святославич, вел.кн. Киевский').
mother('Малуша 	 ', 'Владимир I Святославич Святой, вел.кн. Киевский').
mother('Ольга Мудрая, кн. Киевская', 'Святослав I, вел.кн. Киевский').
mother('Рогнеда Рогволодовна, кнж. Полоцкая', 'Ярослав I Владимирович Мудрый, вел.кн. Киевский').
mother('Рогнеда Рогволодовна, кнж. Полоцкая', 'Предслава Владимировна, кнж. Киевская').
mother('Рогнеда Рогволодовна, кнж. Полоцкая', 'Премислава Владимировна, кнж. Киевская').
mother('Юлия Греческая', 'Святополк I Владимирович Окаянный, вел.кн. Киевский').
mother('Индигерда (Анна) Шведская', 'Святослав II Ярославич, вел.кн. Киевский').
mother('Индигерда (Анна) Шведская', 'Всеволод I Ярославич, вел.кн. Киевский').
mother('Индигерда (Анна) Шведская', 'Изяслав I (Дмитрий) Ярославич, вел.кн. Киевский').
mother('Индигерда (Анна) Шведская', 'Елизавета Ярославна, кнж. Киевская').
mother('Индигерда (Анна) Шведская', 'Анастасия Ярославна, кнж. Киевская').
mother('Индигерда (Анна) Шведская', 'Анна Ярославна Киевская').
mother('Киликия ', 'Предслава Святославна, кнж. Киевская').
mother('Феофано Музалон', 'Всеволод II Ольгович, вел.кн. Киевский').
mother('Феофано Музалон', 'Игорь II Ольгович, вел.кн. Киевский').
mother('Агафья Мстиславна, кнж. Киевская', 'Святослав III Всеволодович, вел.кн. Киевский').
mother('Агафья Мстиславна, кнж. Киевская', 'Ярослав Всеволодович, кн. Черниговский').
mother('Агафья Мстиславна, кнж. Киевская', 'Владимир Всеволодович, кнж. Черниговский').
mother('Агафья Мстиславна, кнж. Киевская', 'Анна Всеволодовна, кнж. Черниговская').
mother('Агафья Мстиславна, кнж. Киевская', 'Звенислава Всеволодовна, кнж. Черниговская').
mother('Мария Васильковна, кнж. Витебская', 'Всеволод III Святославич Чермный, вел.кн. Киевский').
mother('Мария Польская', 'Михаил II Всеволодович Святой, вел.кн. Киевский').
mother('Ирина (Мария) Мономах', 'Владимир II Всеволодович Мономах, вел.кн Киевский').
mother('Ирина (Мария) Мономах', 'Анна (Янка) Всеволодовна, кнж. Киевская').
mother('Анна, кнж. Половецкая', 'Евпраксия (Адельгейда) Всеволодовна, кнж. Киевская').
mother('Анна, кнж. Половецкая', 'Екатерина Всеволодовна, кнж. Киевская').
mother('Гита Английская', 'Мстислав I Владимирович Великий, вел.кн. Киевский').
mother('Гита Английская', 'Юрий I Владимирович Долгорукий, вел.кн. Киевский').
mother('Гита Английская', 'Агафья Владимировна, кнж. Киевская').
mother('Гита Английская', 'Ярополк II Владимирович, вел.кн. Киевский').
mother('Гита Английская', 'Мария Владимировна, кнж. Киевская').
mother('Гита Английская', 'Евдоксия (Софья) Владимировна, кнж. Киевская').
mother('Гита Английская', 'Евфимия Владимировна, кнж. Киевский').
mother('Гита Английская', 'Вячеслав Владимирович, вел.кн. Киевский').
mother('Христина Шведская', 'Изяслав II Мстиславич, вел.кн. Киевский').
mother('Христина Шведская', 'Ростислав I Мстиславич, вел. кн. Киевский').
mother('Христина Шведская', 'Ксения Мстиславна, кнж. Киевская').
mother('Христина Шведская', 'Ингеборга Мстиславна, кнж. Киевская').
mother('Христина Шведская', 'Святолюба Мстиславна, кнж. Киевская').
mother('Христина Шведская', 'Агафья Мстиславна, кнж. Киевская').
mother('Христина Шведская', 'Малфрида Мстиславна, кнж. Киевская').
mother('Христина Шведская', 'Евпраксия (Ирина) Мстиславна, кнж. Киевская').
mother('Христина Шведская', 'Рогнеда Мстиславна, кнж. Киевская').
mother('Любава Дмитриевна ', 'Михаил Мстиславич, кнж. Киевский').
mother('Любава Дмитриевна ', 'Ефросинья Умная Мстиславна, кнж. Киевская').
mother('Любава Дмитриевна ', 'Владимир III Мстиславич Мачешич, вел.кн. Киевский').
mother('Анна Юрьевна, кнж. Туровская', 'Владимир IV (Дмитрий) Рюрикович, вел.кн. Киевский').
mother('Анна Юрьевна, кнж. Туровская', 'Ростислав II Рюрикович, вел.кн. Киевский').
mother('Анна, кнж. Половецкая', 'Ольга Юрьевна, кнж. Киевская').
mother('Анна, кнж. Половецкая', 'Глеб Юрьевич, вел.кн. Киевский').
mother('Премислава Владимировна, кнж. Киевская', 'Бонусло Венгерский').
mother('Мария-Добронега Владимировна, кнж. Киевская', 'Болеслав II Смелый Польский').
mother('Мария-Добронега Владимировна, кнж. Киевская', 'Владислав I Герман Польский').
mother('Мария-Добронега Владимировна, кнж. Киевская', 'Святослава (Сватава) Польская').
mother('Евдоксия (Софья) Владимировна, кнж. Киевская', 'Василько Святославич, кн. Полоцкий').
mother('Евдоксия (Софья) Владимировна, кнж. Киевская', 'Вячеслав Святославич, кн. Витебский').
mother('Евдоксия (Софья) Владимировна, кнж. Киевская', 'Давыд Святославич, кнж. Витебский').
mother('Евдоксия (Софья) Владимировна, кнж. Киевская', 'Предслава (Ефросинья) Святославна, кнж. Полоцкая').
mother('Евдоксия (Софья) Владимировна, кнж. Киевская', 'Градислава (Евдокия) Святославна, кнж. Полоцкая').
mother('Ингеборга Мстиславна, кнж. Киевская', 'Кристина Датская').
mother('Ингеборга Мстиславна, кнж. Киевская', 'Вальдемар I ВеликийДатский').
mother('Ингеборга Мстиславна, кнж. Киевская', 'Маргарита Датская').
mother('Ингеборга Мстиславна, кнж. Киевская', 'Екатерина Датская').
mother('Гертруда (Елена) Польская', 'Святополк II (Михаил) Изяславич, вел.кн. Киевский').
mother('Гертруда (Елена) Польская', 'Евпраксия (Вышеслава) Изяславна, кнж. Киевская').
mother('Елизавета Ярославна, кнж. Киевская', 'Ингигерда Норвежская').
mother('Анастасия Ярославна, кнж. Киевская', 'Соломон Венгерский').
mother('Анастасия Ярославна, кнж. Киевская', 'Давид Венгерский').
mother('Анастасия Ярославна, кнж. Киевская', 'Аделаида (Адлейта) Венгерская').
mother('Агафья Владимировна, кнж. Киевская', 'Борис Всеволодкович, кн. Городненский').
mother('Агафья Владимировна, кнж. Киевская', 'Глеб Всеволодкович, кн. Городненский').
mother('Агафья Владимировна, кнж. Киевская', 'Мстислав Всеволодкович, кн. Городненский').
mother('Агафья Владимировна, кнж. Киевская', 'Анна Всеволодковна, кнж. Городненская').
mother('Феодосия ', 'Изяслав III Давыдович, вел.кн. Киевский').
mother('Ольга Юрьевна, кнж. Киевская', 'Владимир Ярославич, кн. Галицкий').
mother('Ольга Юрьевна, кнж. Киевская', 'Ефросинья Ярославна, кнж. Галицкая').
mother('Ольга Юрьевна, кнж. Киевская', 'Вышеслава Ярославна, кнж. Галицкая').
mother('Свобода, кнж. Половецкая', 'Изяслав IV Владимирович, вел.кн. Киевский').
mother('Ефросинья Умная Мстиславна, кнж. Киевская', 'Стефан (Иштван) III Венгерский').
mother('Ефросинья Умная Мстиславна, кнж. Киевская', 'Геза Венгерский').
mother('Ефросинья Умная Мстиславна, кнж. Киевская', 'Адель Венгерская').
mother('Ефросинья Умная Мстиславна, кнж. Киевская', 'Елизавета Венгерская').
mother('Ефросинья Умная Мстиславна, кнж. Киевская', 'Бела III Венгерский').
mother('Ефросинья Умная Мстиславна, кнж. Киевская', 'Елена (Илона) Венгерская').
mother('Ефросинья Умная Мстиславна, кнж. Киевская', 'Маргарита Венгерская').
mother('Елена, кнж. Половецкая', 'Изяслав Святополчич, кнж. Киевский').
mother('Елена, кнж. Половецкая', 'Брячислав Святополчич, кнж. Киевский').
mother('Варвара Комнин', 'Мария Святополковна, кнж. Киевская').
mother('Предслава Святополковна, кнж. Киевская', 'Бела II Слепой Венгерский').
mother('Предслава Святополковна, кнж. Киевская', 'Аделаида Венгерская').
mother('Предслава Святополковна, кнж. Киевская', 'Гедвига Венгерская').
mother('Сбыслава Святополковна, кнж. Киевская', 'Владислав II Польский').
mother('Святолюба Мстиславна, кнж. Киевская', 'Прибыслава Ярославна, кнж. Владимиро-Волынская').
mother('Святолюба Мстиславна, кнж. Киевская', 'Вячеслав Ярославич, кн. Клецкий').
mother('Ольга Глебовна, кнж. Киевская', 'Святослав Всеволодович, кн. Трубчевский').
mother('Мария Святославна, кнж. Новгород-Северская', 'Мстислав III Романович Старый, вел.кн. Киевский').
mother('Мария Ярославна, кнж. Витебская', 'Владимир Ольгердович, кн. Киевский').
mother('Юлиана Александровна, кнж. Киевская', 'Иван Юрьевич Пронский').
mother('Анастасия Васильевна, кнж. Московская', 'Юлиана Александровна, кнж. Киевская').
mother('Анастасия Васильевна, кнж. Московская', 'Евдокия Александровна, кнж. Киевская').
mother('Анастасия Васильевна, кнж. Московская', 'Семен Александрович, кн. Киевский').
mother('Анастасия Васильевна, кнж. Московская', 'Феодосия Александровна, кнж. Киевская').
mother('Евфимия Владимировна, кнж. Киевский', 'Борис (Конрад) Коломанович Венгерский').
mother('Малфрида Мстиславна, кнж. Киевская', 'Свен III Грате Датский').
mother('Евдокия Александровна, кнж. Киевская', 'Елена Молдавская').
mother('Мария Ивановна Гаштольд', 'Александра Семеновна, кнж. Киевская').
mother('Мария Ивановна Гаштольд', 'Софья Семеновна, кнж. Киевская').
mother('Мария Ивановна Гаштольд', 'Елена Семеновна, кнж. Киевская').
mother('Мария ', 'Глеб Андреевич, кн. Киевский').
mother('Мария ', 'Евдокия Андреевна, кнж. Киевская').
mother('Анна Ярославна Киевская', 'Филипп I Французский').
mother('Анна Ярославна Киевская', 'Роберт Французский').
mother('Анна Ярославна Киевская', 'Гуго I (V) Великий деВермандуа').
mother('Анна Ярославна Киевская', 'Эмма Французская').
